// Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
// таблиця множення
function multiply() {
  for (let i = 2; i <= 9; i++) {
    console.log(`Таблиця множення для ${i}:`);

    for (let j = 1; j <= 10; j++) {
      let result = i * j;
      console.log(`${i} * ${j} = ${result}`);
    }
  }

  console.log("\n"); // Додатковий рядок для розділення таблиць
}

// Запитай дату (день, місяць, рік) і виведи наступну за нею дату.
// Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.

function getDate(a, b, c) {
  if (
    typeof a !== "number" ||
    isNaN(a) ||
    typeof b !== "number" ||
    isNaN(b) ||
    typeof c !== "number" ||
    isNaN(c)
  ) {
    throw new Error("всі дані мають бути числовими значеннями.");
  }
  if (a < 1 || a > 31 || b < 1 || b > 12 || c < 1900 || c > 2100) {
    throw new Error("введіть корректні дані");
  }
  return a >= 1 && a <= 29
    ? `${(a += 1)} / ${b} / ${c}`
    : a === 30 && b <= 11
    ? `${(day = 1)} / ${(mounth += 1)} / ${year}`
    : a === 30 && b === 12
    ? `${(a = 1)} / ${(b = 1)} / ${(c += 1)}`
    : "Good luck";
}

export { multiply, getDate };
